src/Catalogs/ПА_Пользователи/ПА_Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПА_Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/РолиПользователей/РолиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиПользователей</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Кассир</name>
  </enumValues>
  <enumValues>
    <name>ОператорАттракциона</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ПА_Пользователи/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПользовательИБ = 
		ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	
	Если ПользовательИБ = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	КонецЕсли;
	
	ПользовательИБ.АутентификацияСтандартная = ДоступРазрешен;
	ПользовательИБ.ПолноеИмя = Объект.Наименование;
	ПользовательИБ.Имя = Логин;
	
	Если ПарольУстановлен Тогда
		ПользовательИБ.Пароль = Пароль;
	КонецЕсли;
		
	ПользовательИБ.Роли.Очистить();
	Если РольПользовтаеля = Перечисления.РолиПользователей.Администратор Тогда
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПА_ПолныеПрава);
	ИначеЕсли РольПользовтаеля = Перечисления.РолиПользователей.Кассир Тогда 
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Кассир);
	ИначеЕсли РольПользовтаеля = Перечисления.РолиПользователей.ОператорАттракциона Тогда 
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ОператорАттракциона);
	КонецЕсли;
		 
	ПользовательИБ.Записать();
	ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПользовательИБ = 
		ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	
	Если ПользовательИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоступРазрешен = ПользовательИБ.АутентификацияСтандартная;
	Логин = ПользовательИБ.Имя;
	
	Если ЗначениеЗаполнено(ПользовательИБ.СохраняемоеЗначениеПароля) Тогда
		Пароль = "******";
	КонецЕсли;
	
	ЭтоАминистратор = Ложь;
	ЭтоКассир = Ложь;
	ЭтоОператорАттракциона = Ложь;
		
	Для Каждого Роль из ПользовательИБ.Роли Цикл

		Если Роль = Метаданные.Роли.Па_ПолныеПрава Тогда
			ЭтоАминистратор = Истина;
		ИначеЕсли Роль = Метаданные.Роли.Кассир Тогда
			ЭтоКассир = Истина;
		ИначеЕсли Роль = Метаданные.Роли.ОператорАттракциона Тогда
			ЭтоОператорАттракциона = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтоАминистратор Тогда
		РольПользовтаеля = Перечисления.РолиПользователей.Администратор;
	ИначеЕсли ЭтоКассир Тогда
		РольПользовтаеля = Перечисления.РолиПользователей.Кассир;
	ИначеЕсли ЭтоОператорАттракциона Тогда
		РольПользовтаеля = Перечисления.РолиПользователей.ОператорАттракциона;
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Пароль = "******";
	Элементы.Пароль.РежимПароля = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеДоступностьюЭлементовФорм(ЭтотОбъект)
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольУстановлен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДоступРазрешенПриИзменении(Элемент)
	УправлениеДоступностьюЭлементовФорм(ЭтотОбъект)
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СгенерироватьПароль(Команда)
	
	Пароль = СлучайныйПароль();
	Элементы.Пароль.РежимПароля = Ложь;
	ПарольУстановлен = Истина;
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

&НаСервереБезКонтекста
Функция СлучайныйПароль()
	ГСП = Новый ГенераторСлучайныхПаролей();
	Возврат ГСП.СлучайныйПароль(8,Истина);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностьюЭлементовФорм(Форма)
	
	УправлениеПользователемДоступно = Форма.ДоступРазрешен;
	Форма.Элементы.ГруппаПароль.Доступность = УправлениеПользователемДоступно;
	Форма.Элементы.РольПользователя.Доступность = УправлениеПользователемДоступно;
	Форма.Элементы.Логин.Доступность = УправлениеПользователемДоступно;		
	
КонецПроцедуры

#КонецОбласти
